[
  {
  "street": "",
  "artist": "Sarah Jones",
  "image": "https://s3-us-west-2.amazonaws.com/seattle-storefronts/jones.jpg",
  "url": "http://storefrontsseattle.com/2014/03/13/shunpike-announces-eight-new-storefronts-artists-in-south-lake-union/",
  "statement": "<p><i>Botanicals</i>, 2013<br>Mixed Media</p><p><i>Botanicals</i> is an installation of botanical specimens inspired by the real anatomy of plants.</p><p>Each day for one year, the artist collected a botanical specimen from the out-of-doors, whether traveling or on her home turf. The artist strung each of these botanical specimens from the ceiling of her studio, and then began the process of replicating the botanical specimens in a variety of ephemeral materials including: lace, fibers, papers, textiles, hair, rice grains, pussy willows, shells, toilet paper, and threads. The intimate scale, fine detail, and white tone of the botanicals summon the viewer to move in close to examine what is hard to see, and reveal the architecture and beauty of each form.</p><p>Special thanks to Haystack Mountain School of Craft and the Ucross Foundation for their support.</p>",
  "latitude": "47.61982",
  "longitude": "-122.33607"
  },
  {
  "street": "",
  "artist": "Paul Kuniholm Pauper",
  "image": "https://s3-us-west-2.amazonaws.com/seattle-storefronts/pauper.jpg",
  "url": "http://storefrontsseattle.com/2014/03/13/shunpike-announces-eight-new-storefronts-artists-in-south-lake-union/",
  "statement": "<p><i>Time-Based Artwork, Gift 1, Materially Fiber Art (TBAG/MFA),</i> 2014<br>Video, mixed media</p><p>TBAG/MFA distills parameters drawn by architecture, fiber arts, sculpture and time-based artworks down to essential elements, then puts them back together in a way that suggests organic accumulation, such as a beaver dam or spider web. Narratively, TBAG/MFA discusses time and community using fiber arts materials such as vellum over aircraft-grade spruce to suggest high-rise hardscapes. Quotidian cardboard stands in for a luxury motorcar, a symbol of contemporary abundance. Wicker and vellum relate to social codes of dress and identity.</p>",
  "latitude": "47.624417533364316",
  "longitude": "-122.33765602111816"
  },
  {
  "street": "",
  "artist": "Jacob Foran",
  "image": "https://s3-us-west-2.amazonaws.com/seattle-storefronts/foran.jpg",
  "url": "http://storefrontsseattle.com/2014/03/13/shunpike-announces-eight-new-storefronts-artists-in-south-lake-union/",
  "statement": "<p>(L to R) <i>Pawn, Dancer, King, Guardian, Jester,</i> 2010 – 2013<br>Glazed ceramic, gold leaf</p><p>This series presents an imagined reality grounded in the notion of the royal courts and their characters, including Kings, Queens, Jesters, and others. Influenced by historical statuary from Egyptian, Greek, Roman, African, and Venetian cultures, the figures range from appearing regal or majestic to impish and bizarre.</p><p>The artist started with a general conceptual framework for each character, the personas that emerged came through an intense engagement with each object during the making, using the coil technique. The expressive eyes and discernible internal gaze say more than the unsounding lips, frontal postures, and stoic anatomy. Ultimately, the artist’s intention with this body of work was to craft sculptural artifacts that, through figuration, represent an inner world—one that is expressive of the complexities of the human psyche.</p>",
  "latitude": "47.62443199556771",
  "longitude": "-122.33731269836424"
  },
  {
  "street": "",
  "artist": "Evan Blackwell",
  "image": "https://s3-us-west-2.amazonaws.com/seattle-storefronts/blackwell.jpg",
  "url": "http://storefrontsseattle.com/2014/03/13/shunpike-announces-eight-new-storefronts-artists-in-south-lake-union/",
  "statement": "<p><i>Complex</i>, 2013<br>Galvanized and stainless steel</p><p><i>Complex</i> is an assemblage of salvaged structural connectors and stainless steel hardware. Arranged in a pattern inspired by the infrastructure and the physical operating systems of the built environment, <i>Complex</i> responds to the visible and hidden architectural spaces of South Lake Union. Guided by interests in ecology and sustainable urban design, this work is an invitation to engage and participate in the transformation of public spaces into thriving examples of human ecology.</p><p><i>Complex</i> is courtesy of Foster / White Gallery.</p>",
  "latitude": "47.623144843796936",
  "longitude": "-122.33645439147949"
  },
  {
  "street": "",
  "artist": "Natasha Bacca",
  "image": "https://s3-us-west-2.amazonaws.com/seattle-storefronts/bacca.jpg",
  "url": "http://storefrontsseattle.com/2014/03/13/shunpike-announces-eight-new-storefronts-artists-in-south-lake-union/",
  "statement": "<p><i>Memento Mori</i>, 2012<br>Unique chromogenic photogram</p><p><i>Memento Mori</i> is a Latin phrase that translates to 'Remember your mortality.' Referencing the tree of life, this <i>Memento Mori</i> acts as a catalyst for the human imagination to engage with questions surrounding the nature of life and death; on the mortal constraints of all people, and the finite, fragile boundaries of the human body.</p><p><i>Memento Mori</i> acquires a moralizing purpose—the prospect of death serves to emphasize the emptiness and fleetingness of earthly pleasures, luxuries, and achievements, and thus serves as an invitation to focus one's thoughts on the fragility of existence and the prospect of the afterlife. <i>Memento Mori</i> reveals the multifaceted nature of the death-rebirth mystery and serves to illuminate the human life cycle.</p>",
  "latitude": "47.621958900629956",
  "longitude": "-122.33636856079102"
  },
  {
  "street": "",
  "artist": "Alison Foshee",
  "image": "https://s3-us-west-2.amazonaws.com/seattle-storefronts/foshee.jpg",
  "url": "http://storefrontsseattle.com/2014/03/13/shunpike-announces-eight-new-storefronts-artists-in-south-lake-union/",
  "statement": "<p><i>The Motherboard</i>, 2014<br>Mixed Media</p><p>Clusters of flowers and solitary blooms composed of pushpins and stickers emerge from surfaces laminated with used maps, music scores, card stock, and graph paper.</p><p>Using recycled and repurposed materials, <i>The Motherboard</i> is an exploration of systems. These systems, whether biological or technological, provide structure and a foundation for adaptation. The title, <i>The Motherboard</i> most obviously references the main circuit boards found in computers, but it is also intended to reference Mother Nature and lower tech devices for memory, such as bulletin boards.</p><p>The theme of ecology and mindfulness is present, as are certain aspects of the aesthetic concept of Wabi-sabi, which celebrates transience and finds the beauty in the old and imperfect. Just as yesterday’s newspaper can be made into mulch for our gardens, the functionality of these scraps and stained bits of paper find new life as art.</p>",
  "latitude": "47.62192997485076",
  "longitude": "-122.3360252380371"
  },
  {
  "street": "",
  "artist": "Kathleen Skeels",
  "image": "https://s3-us-west-2.amazonaws.com/seattle-storefronts/skeels.jpg",
  "url": "http://storefrontsseattle.com/2014/03/13/shunpike-announces-eight-new-storefronts-artists-in-south-lake-union/",
  "statement": "<p><i>Albatross</i>, 2013<br>Glazed ceramic</p><p>The albatross egg sits on a remote island. That is its only defense. On land the parents are nearly as vulnerable as the egg. They are built for life at sea. They only return to land every couple of years to lay the egg. Once the albatross chick is big enough to stay warm, the parents return to the ocean to hunt for food, leaving the chick for longer and longer intervals, a week and more.</p><p>Will the parents survive to come back and feed their chick? Fish lines can be a problem. Will the chick survive or die of starvation, its crop full of plastic garbage the parents mistook for squid and fish?</p>",
  "latitude": "47.62097541515849",
  "longitude": "-122.33654022216795"
  },
  {
  "street": "",
  "artist": "Cheryl Zahniser",
  "image": "https://s3-us-west-2.amazonaws.com/seattle-storefronts/zahniser.jpg",
  "url": "http://storefrontsseattle.com/2014/03/13/shunpike-announces-eight-new-storefronts-artists-in-south-lake-union/",
  "statement": "<p><i>Tamiyasu Family Series</i>, 2010<br>Charcoal and Conté crayon on paper</p><p>As an oil painter focused primarily on portraits, Cheryl Zahniser is thrilled to present these portraits of my her family and their place in the history of the Pacific Northwest.</p><p>Three years ago my the artist’s mother gave her a bag full of family letters and photos. It contained many profound images, meaningful to the artist personally, but also a record of an important episode of Asian Northwest history. Included were photos of her mother’s parents from the 40’s and 50’s. They owned a prominent Japanese restaurant, called the New Tokyo, which was one of the first Japanese food establishments in Portland.</p><p>Inspired by these stories, the artist created large charcoal and conte drawings from these photographs, including images of her grandmother in her Kimono, cooking in the kitchen, a friend sitting in the tatami room, and other reflections from before she arrived to the US. Upon showing some of the artwork with her aunt, the emotion in her aunt’s voice and the expression on her face reinforced the emotion resonant in these simple and deeply personal drawings.</p>",
  "latitude": "47.62101880461351",
  "longitude": "-122.3362612724304"
  }
]